login-JMeter.yaml

# Script generated by Blazemeter Chrome Extension

execution:
  - scenario: login
    concurrency: 20
    ramp-up: 1m
    hold-for: 19m
scenarios:
  login:
    headers:
      sec-ch-ua: '"Not.A/Brand";v="8", "Chromium";v="114", "Google Chrome";v="114"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/114.0.0.0 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://opensource-demo.orangehrmlive.com/web/index.php/auth/validate'
            method: POST
            label: 'https://opensource-demo.orangehrmlive.com/web/index.php/auth/validate'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
            body:
              _token: 1c2678a4d9657f3fe1d2ed4ebe7dedcb.vxtw9o29VsuH2Z0OuRg6xb_mCxRUED6UdcgFdElMxTI.7kQTkODJLJHYkflqy3BemuixJncwaFP2EJxuRHgalwXqazuju-Q3_MCPrQ
              password: admin123
              username: Admin
          - url: 'https://opensource-demo.orangehrmlive.com/web/index.php/core/i18n/messages'
            method: GET
            label: 'https://opensource-demo.orangehrmlive.com/web/index.php/core/i18n/messages'
            headers:
              Accept: application/json
              If-None-Match: '"4Ycc1EoUYADulzkHMf7fAiV6fIHisYLQl+ZLfuwFli8="'
              contentType: application/json
          - url: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/employees/time-at-work'
            method: GET
            label: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/employees/time-at-work'
            headers:
              Accept: application/json
              Cache-Control: 'no-store, no-cache, must-revalidate, post-check=0, pre-check=0'
            body:
              timezoneOffset: '7'
              currentDate: '2023-07-17'
              currentTime: '11:51'
          - url: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/employees/action-summary'
            method: GET
            label: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/employees/action-summary'
            headers:
              Accept: application/json
              Cache-Control: 'no-store, no-cache, must-revalidate, post-check=0, pre-check=0'
          - url: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/shortcuts'
            method: GET
            label: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/shortcuts'
            headers:
              Accept: application/json
              Cache-Control: 'no-store, no-cache, must-revalidate, post-check=0, pre-check=0'
          - url: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/buzz/feed'
            method: GET
            label: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/buzz/feed'
            headers:
              Accept: 'application/json, text/plain, */*'
            body:
              limit: '5'
              offset: '0'
              sortOrder: DESC
              sortField: share.createdAtUtc
          - url: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/employees/leaves'
            method: GET
            label: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/employees/leaves'
            headers:
              Accept: application/json
              Cache-Control: 'no-store, no-cache, must-revalidate, post-check=0, pre-check=0'
            body:
              date: '2023-07-17'
          - url: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/employees/subunit'
            method: GET
            label: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/employees/subunit'
            headers:
              Accept: application/json
              Cache-Control: 'no-store, no-cache, must-revalidate, post-check=0, pre-check=0'
          - url: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/employees/locations'
            method: GET
            label: 'https://opensource-demo.orangehrmlive.com/web/index.php/api/v2/dashboard/employees/locations'
            headers:
              Accept: application/json
              Cache-Control: 'no-store, no-cache, must-revalidate, post-check=0, pre-check=0'
          - url: 'https://opensource-demo.orangehrmlive.com/web/index.php/events/push'
            method: POST
            label: 'https://opensource-demo.orangehrmlive.com/web/index.php/events/push'
            headers:
              Accept: application/json